performance/enterprise/test/qa-functional/data/BPELTestProject/src/SynchronousSample.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions 
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="SynchronousSample" targetNamespace="http://localhost/SynchronousSample/SynchronousSample" xmlns:tns="http://localhost/SynchronousSample/SynchronousSample" xmlns:ns="http://xml.netbeans.org/schema/SynchronousSample" xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://localhost/SynchronousSample/SynchronousSample">
            <xsd:import namespace="http://xml.netbeans.org/schema/SynchronousSample" schemaLocation="SynchronousSample.xsd"/>
        </xsd:schema>
    </types>
    <message name="requestMessage">
        <part name="inputType" element="ns:typeA"/>
    </message>
    <message name="responseMessage">
        <part name="resultType" element="ns:typeA"/>
    </message>
    <portType name="portType1">
        <operation name="operation1">
            <input name="input1" message="tns:requestMessage"/>
            <output name="output1" message="tns:responseMessage"/>
        </operation>
    </portType>
    <binding name="binding1" type="tns:portType1">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="operation1">
        <input name="input1">
          <soap:body use="literal"/>
        </input><output name="output1">
    <soap:body use="literal"/>
</output>
        </operation>
    </binding>
    <service name="service1">
        <port name="port1" binding="tns:binding1">
            <documentation/>
            <soap:address location="http://localhost:18181/SynchronousSample"/>
        </port>
    </service>
    <plink:partnerLinkType name="partnerlinktype1">
        <plink:role name="partnerlinktyperole1" portType="tns:portType1"/>
    </plink:partnerLinkType>
</definitions>
