driver-tests/bpelse/assign/AssignJbi/test/testforCR6470807/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:syn="http://xml.netbeans.org/schema/SynchronousSample">
  <soapenv:Body>
    <syn:typeA>
      <syn:paramA>qwerty</syn:paramA>
    </syn:typeA>
  </soapenv:Body>
</soapenv:Envelope>