driver-tests/bpelse/dynamicpartnerlink/SyncSampleEPRAssignJBI/test/EPR is not deployed/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:syn="http://xml.netbeans.org/schema/SynchronousSample" xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing">
  <soapenv:Body>
    <syn:typeA>
      <syn:paramA>EPR from message </syn:paramA>
      <syn:EndpointReference>
        <add:Address>http://localhost:8080/stockQuoteService/stockQuotePort</add:Address>
        <!--Optional:-->
        <add:ReferenceProperties>
          <!--You may enter ANY elements at this point-->
          <AnyElement/>
        </add:ReferenceProperties>
        <!--Optional:-->
        <add:ReferenceParameters>
          <!--You may enter ANY elements at this point-->
          <AnyElement/>
        </add:ReferenceParameters>
        <!--Optional:-->
        <add:PortType xmlns:ptns="http://j2ee.netbeans.org/wsdl/stockQuote">ptns:stockQuotePortType</add:PortType>
        <!--Optional:-->
        <add:ServiceName PortName="stockQuotePort" xmlns:prefix="http://j2ee.netbeans.org/wsdl/stockQuote">prefix:stockQuoteService</add:ServiceName>
        <!--You may enter ANY elements at this point-->
        <AnyElement/>
      </syn:EndpointReference>
    </syn:typeA>
  </soapenv:Body>
</soapenv:Envelope>